{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "/home/nguyend/DeepSeek-VL/chkpoints/models--deepseek-ai--deepseek-vl-7b-chat/snapshots/6f16f00805f45b5249f709ce21820122eeb43556/",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 12,
  "lora_dropout": 0.15,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 6,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "q_proj",
    "o_proj",
    "fc2",
    "k_proj",
    "attn_pool.q",
    "up_proj",
    "attn.qkv",
    "down_proj",
    "fc1",
    "attn_pool.kv",
    "patch_embed.proj",
    "gate_proj",
    "v_proj",
    "attn.proj"
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}