{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "/home/nguyend/DeepSeek-VL/chkpoints/models--deepseek-ai--deepseek-vl-1.3b-chat/snapshots/8f13a8e00dbdc381d614a9d29d61b07e8fe91b3f/",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 8,
  "lora_dropout": 0.2,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 4,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "o_proj",
    "patch_embed.proj",
    "q_proj",
    "v_proj",
    "attn_pool.kv",
    "down_proj",
    "attn.proj",
    "fc2",
    "attn.qkv",
    "up_proj",
    "gate_proj",
    "k_proj",
    "attn_pool.q",
    "fc1"
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}